app/controllers/dics_controller.rb

SELECT * FROM `dics`
SELECT * FROM `dics` LIMIT 25
SELECT count(`dics`.id) AS count_id FROM `dics`
---
  def index

    #@dics = Dic.all
    @dics_all = Dic.all
    @dics = Dic.search params[:search],
    :page => params[:page], :per_page => 2

SELECT * FROM `dics` WHERE (`dics`.`id` = 2)
---
  def show
    @dic = Dic.find(params[:id])

SELECT * FROM `dics` WHERE (`dics`.`id` = 1)
---
  def edit
    @dic = Dic.find(params[:id])

INSERT INTO `dics` (`created_at`, `word`, `updated_at`) VALUES('2009-06-03 09:08:02', 'ok!', '2009-06-03 09:08:02')
---
  def create
    @dic = Dic.new(params[:dic])

    respond_to do |format|
      if @dic.save